### Pandas DataFrame:
     - DataFrame is the most widely used data-structure in data analysis.
     - DataFrame is a table with rows and columns, with rows having an index and columns having the meaningful names.
     - Usually, DataFrames are imported as CSV files,txt,excel...
     - To create the DataFrames using dictionary,2-d numpy array,tuple...

In [2]:
# To create the dataframe using dictionary...
import pandas as pd
d1 ={'Name':['mani','krishna','aadyan','nethra'],
      'Rno':[410,234,210,400],
    'branch':['ece','eee','mech','cse']}
df = pd.DataFrame(d1)
df

      Name  Rno branch
0     mani  410    ece
1  krishna  234    eee
2   aadyan  210   mech
3   nethra  400    cse

In [3]:
# To create the dataframe using 2d-numpy array...
import numpy as np
n1 = np.array([[1,2,3],[5,6,7]])
df2 = pd.DataFrame(n1)
df2

   0  1  2
0  1  2  3
1  5  6  7

In [4]:
# To create the dataframe using tuple..
t1 = ((1,2,3),(4,5,6))
df3 = pd.DataFrame(t1)
df3

   0  1  2
0  1  2  3
1  4  5  6

In [5]:
df

      Name  Rno branch
0     mani  410    ece
1  krishna  234    eee
2   aadyan  210   mech
3   nethra  400    cse

In [6]:
# To get the column names...
df.columns

Index(['Name', 'Rno', 'branch'], dtype='object')

In [9]:
# To get the row values..
print(df.values)
print(len(df.values)) # TO get the number of records...

[['mani' 410 'ece']
 ['krishna' 234 'eee']
 ['aadyan' 210 'mech']
 ['nethra' 400 'cse']]
4

In [10]:
# To get the index positions..
print(df.index)

RangeIndex(start=0, stop=4, step=1)

In [11]:
df

      Name  Rno branch
0     mani  410    ece
1  krishna  234    eee
2   aadyan  210   mech
3   nethra  400    cse

In [12]:
# To get the number of rows and columns..
df.shape

(4, 3)

### pandas indexing:
            -> using row index or columns names

In [13]:
df

      Name  Rno branch
0     mani  410    ece
1  krishna  234    eee
2   aadyan  210   mech
3   nethra  400    cse

In [14]:
print(df['Name']) # series data structure...

0       mani
1    krishna
2     aadyan
3     nethra
Name: Name, dtype: object

In [19]:
df[['Name','Rno','branch']] # 2d-df

      Name  Rno branch
0     mani  410    ece
1  krishna  234    eee
2   aadyan  210   mech
3   nethra  400    cse

In [18]:
df

      Name  Rno branch
0     mani  410    ece
1  krishna  234    eee
2   aadyan  210   mech
3   nethra  400    cse

In [20]:
# head(): To get the first five records..
# head(1): To get the first record..

In [23]:
df.head(2)

      Name  Rno branch
0     mani  410    ece
1  krishna  234    eee

In [25]:
# To print the last record...
# tail(): To get the last five records
# tail(1): To print the last record..
df.tail(2)

     Name  Rno branch
2  aadyan  210   mech
3  nethra  400    cse

In [26]:
# To add new row record...
df.loc[4]=['ganesh',510,'cse']
df

      Name  Rno branch
0     mani  410    ece
1  krishna  234    eee
2   aadyan  210   mech
3   nethra  400    cse
4   ganesh  510    cse

In [27]:
# TO add new column..
df['marks']=[45,67,89,34,56]
df

      Name  Rno branch  marks
0     mani  410    ece     45
1  krishna  234    eee     67
2   aadyan  210   mech     89
3   nethra  400    cse     34
4   ganesh  510    cse     56

In [28]:
# To update the new value ...
df.loc[2,'branch']='eee'
df

      Name  Rno branch  marks
0     mani  410    ece     45
1  krishna  234    eee     67
2   aadyan  210    eee     89
3   nethra  400    cse     34
4   ganesh  510    cse     56

In [29]:
df.loc[2]

Name      aadyan
Rno          210
branch       eee
marks         89
Name: 2, dtype: object

In [30]:
# To delete the row or column ... drop() method
# axis=0 -> row wise
# axis=1 -> columns wise
df

      Name  Rno branch  marks
0     mani  410    ece     45
1  krishna  234    eee     67
2   aadyan  210    eee     89
3   nethra  400    cse     34
4   ganesh  510    cse     56

In [31]:
df=df.drop(2,axis=0)
df

      Name  Rno branch  marks
0     mani  410    ece     45
1  krishna  234    eee     67
3   nethra  400    cse     34
4   ganesh  510    cse     56

In [32]:
# TO delete the particular column...
df = df.drop('branch',axis=1)
df

      Name  Rno  marks
0     mani  410     45
1  krishna  234     67
3   nethra  400     34
4   ganesh  510     56

In [33]:
# TO print the specific value...
df.loc[3,'Name']

'nethra'

In [34]:
df

      Name  Rno  marks
0     mani  410     45
1  krishna  234     67
3   nethra  400     34
4   ganesh  510     56

In [36]:
# To rename the particular single column name..
df.rename(columns={'Rno':'Rollno'},inplace=True)
df

      Name  Rollno  marks
0     mani     410     45
1  krishna     234     67
3   nethra     400     34
4   ganesh     510     56

In [37]:
df

      Name  Rollno  marks
0     mani     410     45
1  krishna     234     67
3   nethra     400     34
4   ganesh     510     56

In [38]:
df.columns=['NAME','ROLLNO','MARKS']
df

      NAME  ROLLNO  MARKS
0     mani     410     45
1  krishna     234     67
3   nethra     400     34
4   ganesh     510     56

### File input/output reading in Pandas:

In [40]:
df2

   0  1  2
0  1  2  3
1  5  6  7

In [51]:
df2.drop(df2.index,inplace=True)
# To delete the all row records
df2

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [55]:
df2.drop(df2.columns,inplace=True,axis=1)
#To delete the column names
df2

Empty DataFrame
Columns: []
Index: []

In [56]:
df2

Empty DataFrame
Columns: []
Index: []

In [59]:
df2.columns=['Name','Rollno']
df2

ValueError: Length mismatch: Expected axis has 0 elements, new values have 2 elements

In [61]:
df2 = pd.read_csv('marks.csv')
df2

      Name  Rollno branch   ds  java  python
0     nani     510    cse   45    67      89
1  krishna     419    ece  100    45      67
2   aadyan     234    eee   25    56      78

In [62]:
df2.shape

(3, 6)

### Sorting:

In [63]:
df2

      Name  Rollno branch   ds  java  python
0     nani     510    cse   45    67      89
1  krishna     419    ece  100    45      67
2   aadyan     234    eee   25    56      78

In [64]:
df2.sort_values('java') # Single column name

      Name  Rollno branch   ds  java  python
1  krishna     419    ece  100    45      67
2   aadyan     234    eee   25    56      78
0     nani     510    cse   45    67      89

In [65]:
# TO sort the multiple column names...
df2.sort_values(['ds','python'])

      Name  Rollno branch   ds  java  python
2   aadyan     234    eee   25    56      78
0     nani     510    cse   45    67      89
1  krishna     419    ece  100    45      67

In [66]:
df2.sort_values('Name')

      Name  Rollno branch   ds  java  python
2   aadyan     234    eee   25    56      78
1  krishna     419    ece  100    45      67
0     nani     510    cse   45    67      89